In [4]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.getOrCreate()

In [ ]:
id,name,city,amount
1,,hyd,100
,clarke,,
3,mike,,
4,chris,ny,1000

In [5]:
spark

In [7]:
df = spark.read.format("csv") \
.option("header","true") \
.option("inferSchema","true") \
.load("/user/itv007180/text.txt")

In [9]:
df.show()

+----+------+----+------+
|  id|  name|city|amount|
+----+------+----+------+
|   1|  null| hyd|   100|
|null|clarke|null|  null|
|   3|  mike|null|  null|
|   4| chris|  ny|  1000|
+----+------+----+------+

In [16]:
df.fillna(value=0)

+---+------+----+------+
| id|  name|city|amount|
+---+------+----+------+
|  1|  null| hyd|   100|
|  0|clarke|null|     0|
|  3|  mike|null|     0|
|  4| chris|  ny|  1000|
+---+------+----+------+

In [28]:
df.fillna(value="",subset=['city','name'])

+----+------+----+------+
|  id|  name|city|amount|
+----+------+----+------+
|   1|      | hyd|   100|
|null|clarke|    |  null|
|   3|  mike|    |  null|
|   4| chris|  ny|  1000|
+----+------+----+------+

In [24]:
df.fillna({'city':"",'name':""})

+----+------+----+------+
|  id|  name|city|amount|
+----+------+----+------+
|   1|      | hyd|   100|
|null|clarke|    |  null|
|   3|  mike|    |  null|
|   4| chris|  ny|  1000|
+----+------+----+------+

In [29]:
df.na.fill({'city':"",'name':""})

+----+------+----+------+
|  id|  name|city|amount|
+----+------+----+------+
|   1|      | hyd|   100|
|null|clarke|    |  null|
|   3|  mike|    |  null|
|   4| chris|  ny|  1000|
+----+------+----+------+